backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  - [input_2, 0, 0]
  - [input_3, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 160, 160, 1]
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 10, 10, 1]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Sequential
    config:
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        batch_input_shape: !!python/tuple [null, 160, 160, 1]
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: &id001 !!python/tuple [1, 1]
        dtype: float32
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_7
        padding: same
        strides: &id002 !!python/tuple [1, 1]
        trainable: true
        use_bias: true
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_8
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    - class_name: MaxPooling2D
      config:
        data_format: channels_last
        name: max_pooling2d_1
        padding: same
        pool_size: !!python/tuple [2, 2]
        strides: !!python/tuple [2, 2]
        trainable: true
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_9
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 128
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_10
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    - class_name: Conv2DTranspose
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_transpose_5
        padding: same
        strides: !!python/tuple [2, 2]
        trainable: true
        use_bias: true
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    name: sequential_2
  - class_name: Sequential
    config:
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        batch_input_shape: !!python/tuple [null, 10, 10, 1]
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        dtype: float32
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_1
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_2
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    - class_name: Conv2DTranspose
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_transpose_1
        padding: same
        strides: !!python/tuple [2, 2]
        trainable: true
        use_bias: true
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_3
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    - class_name: Conv2DTranspose
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_transpose_2
        padding: same
        strides: !!python/tuple [2, 2]
        trainable: true
        use_bias: true
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_4
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    - class_name: Conv2DTranspose
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_transpose_3
        padding: same
        strides: !!python/tuple [2, 2]
        trainable: true
        use_bias: true
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_5
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    - class_name: Conv2DTranspose
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_transpose_4
        padding: same
        strides: !!python/tuple [2, 2]
        trainable: true
        use_bias: true
    - class_name: Conv2D
      config:
        activation: relu
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_6
        padding: same
        strides: *id002
        trainable: true
        use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    - - - input_3
        - 0
        - 0
        - {}
    name: sequential_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 10, 10, 1]
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: Subtract
    config: {name: subtract_1, trainable: true}
    inbound_nodes:
    - - - sequential_2
        - 1
        - 0
        - &id003 {}
      - - sequential_1
        - 1
        - 0
        - *id003
    name: subtract_1
  - class_name: Add
    config: {name: add_1, trainable: true}
    inbound_nodes:
    - - - subtract_1
        - 0
        - 0
        - &id004 {}
      - - sequential_1
        - 2
        - 0
        - *id004
    name: add_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_11
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: conv2d_11
  name: model_1
  output_layers:
  - [conv2d_11, 0, 0]
keras_version: 2.1.2
